In [103]:
import funcs 
import pandas as pd
from functools import reduce

In [17]:
Driving_Distance_urls = funcs.Driving_Distance_urls

# URL lists

In [18]:
Fairway_Percent_URLs = []
for url in Driving_Distance_urls:
    Fairway_Percent_URLs.append(url.replace('101', '102'))

In [19]:
Greens_Percent_URLs = []
for url in Driving_Distance_urls:
    Greens_Percent_URLs.append(url.replace('101', '103'))

In [20]:
Top_10_URLs = []
for url in Driving_Distance_urls:
    Top_10_URLs.append(url.replace('101', '138'))

In [21]:
Par_Breakers_URLs = []
for url in Driving_Distance_urls:
    Par_Breakers_URLs.append(url.replace('101', '105'))

In [22]:
Average_Score = []
for url in Driving_Distance_urls:
    Average_Score.append(url.replace('101', '108'))

In [23]:
Official_Money = []
for url in Driving_Distance_urls:
    Official_Money.append(url.replace('101', '109'))

In [24]:
Par3_Birdie = []
for url in Driving_Distance_urls:
    Par3_Birdie.append(url.replace('101', '112'))

In [25]:
Par4_Birdie = []
for url in Driving_Distance_urls:
    Par4_Birdie.append(url.replace('101', '113'))

In [26]:
Par5_Birdie = []
for url in Driving_Distance_urls:
    Par5_Birdie.append(url.replace('101', '114'))

In [27]:
Avg_Score_b4_cut = []
for url in Driving_Distance_urls:
    Avg_Score_b4_cut.append(url.replace('101', '116'))

# Dataframes

# DrivingStats df1

In [31]:
Driving_Stats = funcs.get_driving_stats(Driving_Distance_urls)

In [39]:
df1 = pd.DataFrame(Driving_Stats)

In [42]:
df1.head()

            Player  Driving_Rank  Average_Drive_Distance  Year
0    Fuzzy Zoeller             1                   267.4  1980
1  Barney Thompson             2                   267.1  1980
2       J.C. Snead             3                   266.9  1980
3    Buddy Gardner             4                   266.8  1980
4    Jack Nicklaus             5                   265.9  1980

# FairwayStats df2

In [55]:
Fairway = funcs.get_fairway_stats(Fairway_Percent_URLs)

In [56]:
df2 = pd.DataFrame(Fairway)

In [62]:
df2.head()

         Player  Percent_Fairway_Hit  Year
0     Mike Reid                80.82  1980
1  Calvin Peete                79.03  1980
2   Bill Rogers                78.40  1980
3  Gene Littler                75.66  1980
4  Hubert Green                75.62  1980

# GreenStats df3

In [58]:
Greens = funcs.get_greens_hit(Greens_Percent_URLs)

In [60]:
df3 = pd.DataFrame(Greens)

In [101]:
df3.head()

          Player  Percent_Greens_Hit  Year
0      Mike Reid               71.11  1980
1  John Mahaffey               70.99  1980
2  Jack Nicklaus               70.83  1980
3   Larry Nelson               70.51  1980
4     Mark Pfeil               69.81  1980

# Top10Stats df4

In [63]:
T10s = funcs.get_top10s(Top_10_URLs)

In [66]:
df4 = pd.DataFrame(T10s)

In [69]:
df4.head()

          Player  Top_10's  Year
0  Raymond Floyd       5.0  1980
1     Tom Watson       5.0  1980
2  Fuzzy Zoeller       4.0  1980
3   Keith Fergus       4.0  1980
4   George Burns       4.0  1980

# ParBreakStats df5

In [71]:
parbreak = funcs.get_break_par_rank(Par_Breakers_URLs)

In [72]:
df5 = pd.DataFrame(parbreak)

In [73]:
df5.head()

         Player  Percent_BreakPar_Rank  Year
0     Andy Bean                      1  1980
1   Lee Trevino                      2  1980
2    Tom Watson                      3  1980
3   Tom Purtzer                      4  1980
4  Larry Nelson                      5  1980

# AvgScore df6

In [74]:
score = funcs.get_avg_score_rank(Average_Score)

In [75]:
df6 = pd.DataFrame(score)

In [76]:
df6.head()

          Player  Avg_Score_Rank  Year
0     Tom Watson               1  1980
1   Keith Fergus               2  1980
2  Bruce Lietzke               3  1980
3    Lee Trevino               4  1980
4   Larry Nelson               5  1980

# MoneyStats df7

In [77]:
money = funcs.get_money_rank(Official_Money)

In [78]:
df7 = pd.DataFrame(money)

In [79]:
df7.head()

          Player  Money_Rank  Year
0     Tom Watson           1  1980
1  Craig Stadler           2  1980
2    Lee Trevino           3  1980
3   George Burns           4  1980
4      Andy Bean           5  1980

# Par3BirdStats df8

In [80]:
par3 = funcs.get_par3_bird(Par3_Birdie)

In [81]:
df8 = pd.DataFrame(par3)

In [82]:
df8.head()

             Player  Percent_Par3_Bird  Year
0       Lee Trevino              19.05  1980
1        Bob Murphy              18.92  1980
2    Artie McNickle              18.75  1980
3       Jim Colbert              18.75  1980
4  Peter Oosterhuis              18.33  1980

# Par4BirdStats df9

In [83]:
par4 = funcs.get_par4_bird(Par4_Birdie)

In [84]:
df9 = pd.DataFrame(par4)

In [85]:
df8.head()

             Player  Percent_Par3_Bird  Year
0       Lee Trevino              19.05  1980
1        Bob Murphy              18.92  1980
2    Artie McNickle              18.75  1980
3       Jim Colbert              18.75  1980
4  Peter Oosterhuis              18.33  1980

# Par5BirdStats df10

In [86]:
par5 = funcs.get_par5_bird(Par5_Birdie)

In [87]:
df10 = pd.DataFrame(par5)

In [88]:
df10.head()

           Player  Percent_Par5_Bird  Year
0     Tom Purtzer              54.31  1980
1      Lon Hinkle              47.06  1980
2      Tom Watson              47.00  1980
3  Peter Jacobsen              45.45  1980
4   Bobby Wadkins              45.08  1980

# AvgScoreb4Cut df11

In [89]:
avgscore = funcs.get_avg_scoreb4cut(Avg_Score_b4_cut)

In [90]:
df11 = pd.DataFrame(avgscore)

In [91]:
df11.head()

          Player  Avg_scoreB4cut  Year
0     Tom Watson           69.79  1980
1  John Mahaffey           70.47  1980
2   Keith Fergus           70.62  1980
3      Andy Bean           70.67  1980
4   Larry Nelson           70.71  1980

# Top10 Masters DF

In [92]:
top10 = pd.read_excel('MastersTop10_1980-2019.xlsx')

In [95]:
top10.head()

   Year            Player  Masters_Top_10
0  1980  Seve Ballesteros               1
1  1980     Gibby Gilbert               1
2  1980       Jack Newton               1
3  1980      Hubert Green               1
4  1980      David Graham               1

# Top25 Masters DF

In [96]:
top25 = pd.read_excel('MastersTop25_1980-2019.xlsx')

In [98]:
top25.head()

   Year            Player  Masters_Top_25
0  1980  Seve Ballesteros               1
1  1980     Gibby Gilbert               1
2  1980       Jack Newton               1
3  1980      Hubert Green               1
4  1980      David Graham               1

# Merge All DFs - Put in CSV

In [104]:
data_frames = [df1,df2,df3,df4,df5,df6,df7,df8,df9,df10,df11,top10,top25]

In [105]:
Masters_Stats = reduce(lambda  left,right: pd.merge(left,right,on=['Year','Player'],
                                            how='outer'), data_frames)

In [120]:
Masters_Stats.head()

,Player,Driving_Rank,Average_Drive_Distance,Year,Percent_Fairway_Hit,Percent_Greens_Hit,Top_10's,Percent_BreakPar_Rank,Avg_Score_Rank,Money_Rank,Percent_Par3_Bird,Percent_Par4_Bird,Percent_Par5_Bird,Avg_scoreB4cut,Masters_Top_10,Masters_Top_25
0,Fuzzy Zoeller,1.0,267.4,1980,63.10,62.81,4.0,32.0,38.0,29.0,12.14,12.31,41.53,71.5,0.0,1.0
1,Barney Thompson,2.0,267.1,1980,56.75,59.26,NaN,141.0,130.0,124.0,5.56,7.61,33.82,72.7,NaN,NaN
2,J.C. Snead,3.0,266.9,1980,59.13,63.27,1.0,124.0,28.0,42.0,5.56,12.20,28.15,71.1,0.0,1.0
3,Buddy Gardner,4.0,266.8,1980,56.56,62.91,NaN,50.0,88.0,84.0,13.70,10.51,38.46,72.2,NaN,NaN
4,Jack Nicklaus,5.0,265.9,1980,70.36,70.83,1.0,26.0,9.0,26.0,13.75,17.16,25.00,71.4,0.0,0.0

In [125]:
Masters_Stats.to_csv('Masters_Stats0.csv', index = False)

In [126]:
masters = pd.read_csv('Masters_Stats0.csv')

In [127]:
masters.head()

,Player,Driving_Rank,Average_Drive_Distance,Year,Percent_Fairway_Hit,Percent_Greens_Hit,Top_10's,Percent_BreakPar_Rank,Avg_Score_Rank,Money_Rank,Percent_Par3_Bird,Percent_Par4_Bird,Percent_Par5_Bird,Avg_scoreB4cut,Masters_Top_10,Masters_Top_25
0,Fuzzy Zoeller,1.0,267.4,1980,63.10,62.81,4.0,32.0,38.0,29.0,12.14,12.31,41.53,71.5,0.0,1.0
1,Barney Thompson,2.0,267.1,1980,56.75,59.26,NaN,141.0,130.0,124.0,5.56,7.61,33.82,72.7,NaN,NaN
2,J.C. Snead,3.0,266.9,1980,59.13,63.27,1.0,124.0,28.0,42.0,5.56,12.20,28.15,71.1,0.0,1.0
3,Buddy Gardner,4.0,266.8,1980,56.56,62.91,NaN,50.0,88.0,84.0,13.70,10.51,38.46,72.2,NaN,NaN
4,Jack Nicklaus,5.0,265.9,1980,70.36,70.83,1.0,26.0,9.0,26.0,13.75,17.16,25.00,71.4,0.0,0.0

In [130]:
masters.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11325 entries, 0 to 11324
Data columns (total 16 columns):
Player                    11325 non-null object
Driving_Rank              8153 non-null float64
Average_Drive_Distance    8153 non-null float64
Year                      11325 non-null int64
Percent_Fairway_Hit       8153 non-null float64
Percent_Greens_Hit        8153 non-null float64
Top_10's                  4124 non-null float64
Percent_BreakPar_Rank     8153 non-null float64
Avg_Score_Rank            8154 non-null float64
Money_Rank                10298 non-null float64
Percent_Par3_Bird         8153 non-null float64
Percent_Par4_Bird         8153 non-null float64
Percent_Par5_Bird         8153 non-null float64
Avg_scoreB4cut            8154 non-null float64
Masters_Top_10            3534 non-null float64
Masters_Top_25            3534 non-null float64
dtypes: float64(14), int64(1), object(1)
memory usage: 1.4+ MB